---
kind: enumMember
id: F:Autodesk.Revit.DB.Visual.AssetPropertyType.Double44
enum: Autodesk.Revit.DB.Visual.AssetPropertyType
source: html/3463b8a3-5c87-63c0-03d1-a20e442f6f28.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyType.Double44

Represents property 4x4 Double matrix. The corresponding AssetProperty sub class is AssetPropertyDoubleMatrix44.